
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 1 to change, 3 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.ethos_postgres_host_v15
* Replace
  * module.postgres.azurerm_postgresql_flexible_server.pgsql_server
  * module.postgres.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;backslash_quote&#34;]
  * module.postgres.azurerm_postgresql_flexible_server_database.pg_databases[&#34;ethos&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.ethos_postgres_host_v15 will be updated in-place
  ~ resource "azurerm_key_vault_secret" "ethos_postgres_host_v15" {
        id                      = "https://ethos-shared-aat.vault.azure.net/secrets/ethos-postgres-host-v15/42ed7395041b41ea90a76783e93603c0"
        name                    = "ethos-postgres-host-v15"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # module.postgres.azurerm_postgresql_flexible_server.pgsql_server must be replaced
-/+ resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      ~ delegated_subnet_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/postgresql" -> "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/postgres-expanded" # forces replacement
      ~ fqdn                          = "ethos-postgres-v15-aat.postgres.database.azure.com" -> (known after apply)
      ~ id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-postgres-v15-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/ethos-postgres-v15-aat" -> (known after apply)
        name                          = "ethos-postgres-v15-aat"
      ~ public_network_access_enabled = false -> (known after apply)
        tags                          = {
            "Team Contact"        = "#ethos-repl-service"
            "application"         = "employment-tribunals"
            "autoShutdown"        = "true"
            "builtFrom"           = "ethos-repl-service"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#ethos-repl-service"
            "environment"         = "staging"
            "managedBy"           = "ECM Project"
        }
      - zone                          = "1" -> null
        # (12 unchanged attributes hidden)

      ~ high_availability {
          - standby_availability_zone = "2" -> null
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.postgres.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["backslash_quote"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      ~ id        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-postgres-v15-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/ethos-postgres-v15-aat/configurations/backslash_quote" -> (known after apply)
        name      = "backslash_quote"
      ~ server_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-postgres-v15-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/ethos-postgres-v15-aat" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.postgres.azurerm_postgresql_flexible_server_database.pg_databases["ethos"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      ~ charset   = "UTF8" -> "utf8"
      ~ id        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-postgres-v15-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/ethos-postgres-v15-aat/databases/ethos" -> (known after apply)
        name      = "ethos"
      ~ server_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-postgres-v15-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/ethos-postgres-v15-aat" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

Plan: 3 to add, 1 to change, 3 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":2086,"Program":"tfcmt","SHA1":"","Vars":{}} -->